# CrossSectionApi

| Method  | Description |
|--------|-------------|
| **AddReinforcedCrossSection** | Add a new reinforced cross-section to the project from embedded geometry |
| **GetReinforcedCrossSectionData** | Get reinforced cross-section with full geometry (IOM format) |
| **ImportReinforcedCrossSection** | Import reinforced cross-section from template |
| **ReinforcedCrossSections** | Get reinforced cross sections |

<a id="addreinforcedcrosssection"></a>
## **AddReinforcedCrossSection**
> **RcsReinforcedCrossSection AddReinforcedCrossSection (Guid projectId, ReinforcedCrossSectionData reinforcedCrossSectionData = null)**

Add a new reinforced cross-section to the project from embedded geometry

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | Project ID |  |
| **reinforcedCrossSectionData** | **ReinforcedCrossSectionData** | Reinforced cross-section with embedded geometry.              Materials can be referenced by name (must exist in project) or by ID. | [optional]  |

### Return type

**RcsReinforcedCrossSection**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.RcsApi.Api;
using IdeaStatiCa.RcsApi.Client;
using IdeaStatiCa.RcsApi.Model;

namespace Example
{
    public class AddReinforcedCrossSectionExample
    {
        public static void Main()
        {
            // Create the client which is connected to the service.
            ConnectionApiClientFactory clientFactory = new ConnectionApiClientFactory("http://localhost:5000");
            using (var conClient = await clientFactory.CreateConnectionApiClient())
            {

                var reinforcedCrossSectionData = new ReinforcedCrossSectionData(); // ReinforcedCrossSectionData | Reinforced cross-section with embedded geometry.              Materials can be referenced by name (must exist in project) or by ID. (optional)

                try
                {
                    // Add a new reinforced cross-section to the project from embedded geometry
                    RcsReinforcedCrossSection result = conClient.CrossSection.AddReinforcedCrossSection(projectId, reinforcedCrossSectionData);
                    Debug.WriteLine(result);
                }
                catch (ApiException  e)
                {
                    Console.WriteLine("Exception when calling CrossSection.AddReinforcedCrossSection: " + e.Message);
                    Console.WriteLine("Status Code: " + e.ErrorCode);
                    Console.WriteLine(e.StackTrace);
                }
                finally
                {
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/1/projects/{projectId}/cross-sections/reinforced-cross-sections

#### Using the AddReinforcedCrossSectionWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Add a new reinforced cross-section to the project from embedded geometry
    ApiResponse<RcsReinforcedCrossSection> response = conClient.CrossSection.AddReinforcedCrossSectionWithHttpInfo(projectId, reinforcedCrossSectionData);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling CrossSectionApi.AddReinforcedCrossSectionWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/xml, text/xml, application/*+xml, application/json-patch+json, application/json, text/json, application/*+json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getreinforcedcrosssectiondata"></a>
## **GetReinforcedCrossSectionData**
> **ReinforcedCrossSection GetReinforcedCrossSectionData (Guid projectId, int reinforcedCssSectionId)**

Get reinforced cross-section with full geometry (IOM format)

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | Project ID |  |
| **reinforcedCssSectionId** | **int** | Reinforced cross-section ID |  |

### Return type

**ReinforcedCrossSection**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.RcsApi.Api;
using IdeaStatiCa.RcsApi.Client;
using IdeaStatiCa.RcsApi.Model;

namespace Example
{
    public class GetReinforcedCrossSectionDataExample
    {
        public static void Main()
        {
            // Create the client which is connected to the service.
            ConnectionApiClientFactory clientFactory = new ConnectionApiClientFactory("http://localhost:5000");
            using (var conClient = await clientFactory.CreateConnectionApiClient())
            {

                reinforcedCssSectionId = 56;  // int | Reinforced cross-section ID

                try
                {
                    // Get reinforced cross-section with full geometry (IOM format)
                    ReinforcedCrossSection result = conClient.CrossSection.GetReinforcedCrossSectionData(projectId, reinforcedCssSectionId);
                    Debug.WriteLine(result);
                }
                catch (ApiException  e)
                {
                    Console.WriteLine("Exception when calling CrossSection.GetReinforcedCrossSectionData: " + e.Message);
                    Console.WriteLine("Status Code: " + e.ErrorCode);
                    Console.WriteLine(e.StackTrace);
                }
                finally
                {
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/1/projects/{projectId}/cross-sections/reinforced-cross-sections/{reinforcedCssSectionId}

#### Using the GetReinforcedCrossSectionDataWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Get reinforced cross-section with full geometry (IOM format)
    ApiResponse<ReinforcedCrossSection> response = conClient.CrossSection.GetReinforcedCrossSectionDataWithHttpInfo(projectId, reinforcedCssSectionId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling CrossSectionApi.GetReinforcedCrossSectionDataWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="importreinforcedcrosssection"></a>
## **ImportReinforcedCrossSection**
> **RcsReinforcedCrossSection ImportReinforcedCrossSection (Guid projectId, RcsReinforcedCrossSectionImportData rcsReinforcedCrossSectionImportData = null)**

Import reinforced cross-section from template

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | Project ID |  |
| **rcsReinforcedCrossSectionImportData** | **RcsReinforcedCrossSectionImportData** | Import data containing settings and template | [optional]  |

### Return type

**RcsReinforcedCrossSection**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.RcsApi.Api;
using IdeaStatiCa.RcsApi.Client;
using IdeaStatiCa.RcsApi.Model;

namespace Example
{
    public class ImportReinforcedCrossSectionExample
    {
        public static void Main()
        {
            // Create the client which is connected to the service.
            ConnectionApiClientFactory clientFactory = new ConnectionApiClientFactory("http://localhost:5000");
            using (var conClient = await clientFactory.CreateConnectionApiClient())
            {

                var rcsReinforcedCrossSectionImportData = new RcsReinforcedCrossSectionImportData(); // RcsReinforcedCrossSectionImportData | Import data containing settings and template (optional)

                try
                {
                    // Import reinforced cross-section from template
                    RcsReinforcedCrossSection result = conClient.CrossSection.ImportReinforcedCrossSection(projectId, rcsReinforcedCrossSectionImportData);
                    Debug.WriteLine(result);
                }
                catch (ApiException  e)
                {
                    Console.WriteLine("Exception when calling CrossSection.ImportReinforcedCrossSection: " + e.Message);
                    Console.WriteLine("Status Code: " + e.ErrorCode);
                    Console.WriteLine(e.StackTrace);
                }
                finally
                {
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/1/projects/{projectId}/cross-sections/import-reinforced-cross-section

#### Using the ImportReinforcedCrossSectionWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Import reinforced cross-section from template
    ApiResponse<RcsReinforcedCrossSection> response = conClient.CrossSection.ImportReinforcedCrossSectionWithHttpInfo(projectId, rcsReinforcedCrossSectionImportData);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling CrossSectionApi.ImportReinforcedCrossSectionWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: application/xml, text/xml, application/*+xml, application/json-patch+json, application/json, text/json, application/*+json
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="reinforcedcrosssections"></a>
## **ReinforcedCrossSections**
> **List&lt;RcsReinforcedCrossSection&gt; ReinforcedCrossSections (Guid projectId)**

Get reinforced cross sections

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** | Project ID |  |

### Return type

**List&lt;RcsReinforcedCrossSection&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.RcsApi.Api;
using IdeaStatiCa.RcsApi.Client;
using IdeaStatiCa.RcsApi.Model;

namespace Example
{
    public class ReinforcedCrossSectionsExample
    {
        public static void Main()
        {
            // Create the client which is connected to the service.
            ConnectionApiClientFactory clientFactory = new ConnectionApiClientFactory("http://localhost:5000");
            using (var conClient = await clientFactory.CreateConnectionApiClient())
            {

                try
                {
                    // Get reinforced cross sections
                    List<RcsReinforcedCrossSection> result = conClient.CrossSection.ReinforcedCrossSections(projectId);
                    Debug.WriteLine(result);
                }
                catch (ApiException  e)
                {
                    Console.WriteLine("Exception when calling CrossSection.ReinforcedCrossSections: " + e.Message);
                    Console.WriteLine("Status Code: " + e.ErrorCode);
                    Console.WriteLine(e.StackTrace);
                }
                finally
                {
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/1/projects/{projectId}/cross-sections/reinforced-cross-sections

#### Using the ReinforcedCrossSectionsWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Get reinforced cross sections
    ApiResponse<List<RcsReinforcedCrossSection>> response = conClient.CrossSection.ReinforcedCrossSectionsWithHttpInfo(projectId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling CrossSectionApi.ReinforcedCrossSectionsWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)